1s/ERP/Conf/InformationRegisters/Лико_НастройкиОпововещенияОбЭтапахЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_НастройкиОпововещенияОбЭтапахЗаказа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_НастройкиОпововещенияОбЭтапахЗаказа/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем мВыбраныСсылки;



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мВыбраныСсылки = Новый Массив;
	ВыборЭтапов.Параметры.УстановитьЗначениеПараметра("Заказ",Параметры.Заказ);
	ВыборЭтапов.Параметры.УстановитьЗначениеПараметра("Пользователь", Параметры.Пользователь);
	Заказ = Параметры.Заказ;
	Пользователь = Параметры.Пользователь;
	Если Параметры.ПолныеПрава Тогда
		Элементы.Пользователь.Доступность = Истина;
	Иначе
		Элементы.Пользователь.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборЭтапаНаСервере(Этап)
    КонтрольЭтапов = Ложь;
	МенеджерЗаписи = РегистрыСведений.Лико_НастройкиОпововещенияОбЭтапахЗаказа.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заказ = Заказ;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Этап = Этап;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда	
		МенеджерЗаписи.Удалить();
	Иначе	
		МенеджерЗаписи.Заказ = Заказ;
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Этап = Этап;
		МенеджерЗаписи.Записать();   
		КонтрольЭтапов = Истина;
	КонецЕсли;                   
	
	Если Заказ.КонтрольЭтапов <> КонтрольЭтапов Тогда 
		ЗаказОбъект = Заказ.ПолучитьОбъект();	
		ЗаказОбъект.КонтрольЭтапов = КонтрольЭтапов;
		ЗаказОбъект.ОбменДанными.Загрузка=Истина;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись,);
	КонецЕсли;

КонецПроцедуры // ЭтапВыбранДляОповещения()
 
&НаКлиенте
Процедура ВыборЭтаповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Оповестить" Тогда
		СтандартнаяОбработка = Ложь;
		ОбработатьВыборЭтапаНаСервере(ВыбраннаяСтрока[0]);
		Элементы.ВыборЭтапов.Обновить();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ВыборЭтапов.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	Если Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		Элементы.ВыборЭтапов.Доступность = Ложь;
	Иначе
		Элементы.ВыборЭтапов.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры
